package com.soldesk2.springbootcoup.config;

import java.time.Instant;
import java.util.Arrays;
import java.util.List;
import java.util.Random;

public class MedievalNameGenerator {

    private static Random random = new Random(Instant.now().getEpochSecond());

    public enum gender {
        male, female
    }

    public static String getName() {
        String name = null;

        if (random.nextBoolean()) {
            name = femaleName();
        } else {
            name = maleName();
        }

        return String.format("%s %s", name, surname());
    }

    //ref: https://www.mithrilandmages.com/utilities/MedievalBrowse.php
  
    private static String surname() {
        List<String> names = Arrays.asList(
                //A
                "아를란드", "아비네리", "아브라함스", "아카르도", "아코르네로", "아카드", "애커", "애클린",
                "아담", "애디넬", "애들러", "아포바트", "에이지트", "아게르", "아글리에티", "아그넬리",
                "아길라르", "알만", "아흐메티", "아젤로", "알라냐", "알바니", "앨버스", "앨버트", "알베르트",
                "알렌베르트", "알렉산도르", "알만", "앨러드", "앨런클", "알타드", "알젠", "암브로", "아멜롯",
                "아미엘", "암링거", "아모레", "안셀", "안시오", "안드라스", "안드레타", "안드류", "아넬카",
                "안조스", "아누스", "안토넬리", "아펠", "아펠만스", "아르칸드", "아렌츠", "아르페", "아르고",
                "아놀드", "아켓", "아르탈리", "아룬델", "아슐린", "아텐", "오브리", "아우포트", "오거", "오토인",
                "아잔자", "아조르",
                //B
                "바알", "바벨", "바흐만", "바코스", "바뎀", "바에르츠", "반", "바이얼", "바이겔만", "빅스",
                "바켈", "발라코프", "발라니", "발란디에", "발라노스", "발랑케", "베일레프", "발란", "발타르",
                "바나토니", "반트", "바베리", "바비에", "바르보", "바르델리", "바렌체", "바네벨트", "바로스",
                "바르톨프", "바사글리아", "바스티드", "바토니", "베아", "바이엘", "베흐만", "베코", "베다드",
                "베게만", "벨", "베임러", "벨리에", "벨라민", "벨롯", "벨몬드", "벤스", "벤츠", "베르겐",
                "베르나도", "버나드", "버네커", "베리츠", "베르니에", "버턴", "버티", "베송", "비앙바스키",
                "비쇼프", "블랑", "블롬", "보아스", "보엘", "보데로드", "보겐", "뵈머", "볼람", "볼렌스",
                "본", "부가르드", "불렌즈", "부르주", "브라치", "브랑카", "브라운", "브렘", "브리송", "브로시아",
                "번스타인", "버티", "뷔트너",
                //C
                "카발", "카반스", "카치올라", "케일럿", "칼렌스", "칼리츠", "카멜롯", "캄파뉴", "카나니스",
                "칸델라", "카노", "캔트", "키파소", "카라치오니", "카르보네티", "카돈", "케레나", "카르나자",
                "카르파치오", "카사보우", "카셀", "카탈라니", "카톤", "체이스", "셀라", "첸시", "세루누스키",
                "차본", "샤브리에", "샤르보노", "슈발리에", "쉐빗", "크리스틴", "치코리티", "클라벨", "클리먼",
                "칼라드", "콜롬보", "콤스", "컴투아스", "코넬", "쿠스토", "크루스", "쿠민", "쿨라즈",
                //D
                "다브리", "다함", "다마스코", "다그네스", "데슈케", "도비니", "다우논", "도첸베르크", "드뷔시",
                "데카움", "데커", "데가넬로", "딜리아", "들롱", "데만", "덴하르트", "드 보몽", "데 베르제",
                "드 블레즈", "드 펠리체", "드 라 로슈", "드 몽고메리", "데슘", "듀스", "드 와일드", "디키오",
                "디젤", "디스카우", "디에츠", "디미르", "디네브", "디오니소티", "디트리히", "도프커", "도멘체",
                "도넬리", "돈타스", "도레무스", "도체프", "드릭만", "드레셀", "듀버넬", "듀픽스", "뒤프렌",
                "듀폰", "듀란", "두잔트", "다이엘",
                //E
                "에버하터", "에비", "에브너", "에델만", "부종", "에켈라르트", "에거", "엘링거", "에렌부르크",
                "아인시델", "아인슈타인", "에리히", "엘비", "엘리어드", "에만스", "엥겔스", "엔네스", "에니스",
                "엡케", "엡스타인", "에르베토", "에르하르트", "에릭", "에른트", "에라즈티", "에레아", "어슬러",
                "에르체", "에텐호퍼", "에팅거", "에트멀러", "유벨", "에버츠", "에버첸", "엑셀",
                //F
                "파벨", "파브로", "파비", "파가티", "팔라이즈", "팔코즈", "파너", "파슈", "파우체", "펠더",
                "페네온", "페라라", "페라리", "페르슈트만", "페슬러", "피셔", "피엔스", "피어스", "필러",
                "피셔", "피슐러", "피츠허버트", "플렉", "플레그만", "플로카", "플로레아", "포베스", "포케",
                "폰스", "폰타네시", "포셀라", "파울론", "프라운켈", "프라만", "프랑센", "프랑켄하이머", "프란스",
                "프레드릭", "프레몬트", "프뤼데", "푸트레",
                //G
                "가보르", "가브리엘", "가엘", "갈란테", "갈릴레이", "갈리아노", "갈리지오", "감바치니", "가우논",
                "가린", "가네린", "가스파드", "가스텐벨트", "가체프스카", "가울", "가즈다그", "질링거", "제네비",
                "제노벨리스", "제롤드", "게리츠", "게슬러", "질렌", "기브슈", "길레인", "질레트", "긴체프",
                "기네아", "줄리아니", "지룩스", "글레이즈", "글리셔", "고다드", "괴벨", "괴츠", "골든버거",
                "겔러", "고르디니", "고슬라", "괴츠", "고예트", "그라프", "그레보", "그리핀", "그로네벨트",
                "그로지안", "그루브", "귄트너", "구겐베르거", "길버트", "기요트", "구르카", "굿맨", "줄라이",
                //H
                "하케", "하버랜드", "헤슬러", "하겔", "하넬", "할라드", "할라라", "할스", "헤닝", "한프만",
                "한센", "하코트", "하르멘스", "하트비히", "하르츠", "하슈케", "하우크비츠", "하워드", "히케렌",
                "하이트", "하인만", "헬링거", "헬펜", "하버", "헤르만트", "헤르만", "허쉬", "휴스", "히케",
                "히딩크", "힐라", "힌츠", "호프나겔", "호퍼", "홀만", "호펜", "후이겐스",
                //I
                "이아가르", "이안나코네", "이데", "일리카", "이그너", "일리예프", "임페스", "잉그라오", "인켄",
                "요안니디스", "이오르가", "이투랄데", "율리아노", "이바노프", "이즈엘",
                //J
                "자딘", "제크", "자넷", "자베르", "주베르", "줄리앙", "주크센",
                //K
                "카엘린", "켐퍼", "칸", "카이저", "칼프", "칼렌바흐", "캄페", "칸슈라", "카슬러", "카우프만",
                "케네디", "켄디그", "케슬러", "키엠린", "키어센", "킨트", "키르호프", "클레버", "클라인", "클록",
                "클뢰프슈", "클로셀", "클라이센", "코흐", "코네만", "쾰멜", "콜만", "콘딜리스", "코닝", "코펜",
                "코라오스", "콘만", "코우코디모스", "코우네프", "크라프슈타인", "크라츠", "크라우스", "크렌켈",
                "크뢰츠발트", "크루거", "쿠벨", "쿤", "쿤츠", "쿠즈만", "키프리아누", "키리아코우",
                //L
                "라바디", "라바트", "라 베르체", "라브르", "라카투스", "라카유", "라 클레브", "라고", "라조스",
                "랄란느", "람베르티", "라미엘", "렌더", "랑겐", "라피", "라포르테", "라스카리스", "라티피",
                "로랑", "라반치", "로렌손", "르 블랑", "르 콘테", "리겐오프", "라이프니츠", "라이트너", "르메아르",
                "레니즈", "레오니", "레 페산트", "리벳", "라이센", "링겐", "리트만", "롭스타인", "로펠만", "로엔스",
                "로제", "로만", "롬바르도", "루츠", "로페스", "루아르트", "루데만", "루카노프", "뤼츠",
                //M
                "마젤", "마헬", "마다르", "마젤란", "말러", "마이어", "마이트라", "마제르", "말렉", "마헬", "매들러",
                "머피", "마젤라", "말라시스", "말발레", "마네타", "멘텔", "마르퀴스", "마르갱", "마르코프",
                "마론", "마르세유", "마서린", "마서프티니", "마틴", "마티스", "마스턴", "막시므스", "맥스",
                "메이르", "미센", "마인츠", "멜라스", "메뉴엘", "메르시", "메리", "멀린", "메르슈도프", "메르비스",
                "메서슈미트", "메츠", "뮤러", "마이어", "마이더츠", "미치코프", "미냐드", "미칼리스", "밀로소피치",
                "마이너", "미르발트", "뮐러", "몬셀", "몬텔라", "모라이스", "뮤엘", "멀더", "마이어스",
                //N
                "나플리오티스", "나폴레옹", "나르델로", "나우츠", "네프", "넬라톤", "네메스", "네슬러", "뉴버트",
                "나흐바우어", "노이만", "니벨", "누아르", "노르다겐", "노르딘", "누네스", "니센", "누이츠",
                //O
                "노아", "오버해머", "오덴탈", "오딜로", "올링거", "올리비에", "오스트룸", "오르디나", "올랜도",
                "오몬드", "오스먼드", "오톤", "오토즈", "오비에르", "옥시노스",
                //P
                "파코트", "파셀리", "파카니니", "페이어스", "필라드", "파뇰", "팔라디노", "팔렌베르크", "팔리스",
                "파나타", "파올리", "파펠리온", "파폰", "파렐라", "파슈케", "파텔라", "폴렌", "파블렌코", "페슬리",
                "피저", "펠레그리노", "펜체프", "페슈아", "피트라", "피터슨", "파울러", "피안타", "파카르",
                "피콜리", "필스너", "피넬", "피논", "피란델로", "피렐리", "플랑슈", "플라츠", "플로비츠", "폴",
                "폴로", "포메티", "포르카로", "폴센", "프리시스", "프린스", "프로하스카", "프루나", "푸에츠",
                "펄", "푸스카스",
                //Q
                "케베만", "퀴노", "쿠에브레몽", "킨카르논", "콰켄보슈",
                //R
                "라다카누", "라에프", "라폰", "라이히", "라멜", "란다", "라울린", "라파넬", "라피사르디",
                "라우펜부르크", "라베노", "레베벨린", "레딕", "레갈로", "레일러", "리넬트", "라인하르트", "레이츠",
                "라이젠슈타인", "렘멜츠", "레나우드", "렌켈스", "르누아르", "레텔", "레츠너", "레이어", "리브",
                "리치올로", "리에프", "리나", "린델", "리파누", "로찬트", "로슈", "뢰딩거", "로제르스", "로리히",
                "뢰리히트", "로만", "로마노프", "로메넬", "론디넬라", "루스", "로젤리", "로센", "루아드", "루벨",
                "루이나르트", "루네빌", "리카르트", "릭케",
                //S
                "사빈", "사글라이어", "생안드레", "생클레어", "생제르맹", "솔티디스", "살바도르", "사모스", "샌즈슐트",
                "산토스", "사피아", "새틀러", "사우어", "사왈리슈", "스칼라", "셰커스", "샤빌리", "슈베르트",
                "셰플러", "셸", "쉬드", "실링거", "슐리펜", "슈말츠", "슈미츠", "슈라이너", "슐로프", "슐덴",
                "슐츠", "슈넬", "슐하우저", "스콜랜드", "세갈라", "세네카", "세르반", "세버랜드", "시벨", "슈란츠",
                "시안토스", "시몬드", "시나트라", "슬로스", "스누크", "소올라", "슐레트", "스피처", "스필버그",
                "스타나실라", "스텐벡", "슈타인", "슈타인호펠", "스텐판", "스티치", "스토프", "스토야노바",
                "스트라우스", "스바르츠", "실라", "셀레프체니",
                //T
                "타베", "타브라함", "탄넨바움", "타펜", "타루스", "파우베", "타투리스", "테르니엔", "테첼", "투디크",
                "테로크", "테오도폴로스", "테론", "테우니스", "테렐루드", "티엘", "툰", "토마스", "톰스", "토르너",
                "투엘", "티센", "티켈만", "틸버그", "타일라", "토도로프", "타이렐", "토냐치", "툴레", "토레스",
                "토스카넬리", "트라마치", "트링클", "투트비츠", "투로코",
                //U
                "울먼", "우르바닉", "우르테가", "우레아",
                //V
                "바딤", "발랑스", "발부사", "발렌", "발렌노드", "밸로어", "발루아", "반 애커", "반 에른헴", "반 베를로",
                "반 브루셀", "반 코넬", "바넬", "반 에이크", "반 가버", "반 지젤", "반 하버", "반 레이켄", "반 모어",
                "반 노펜", "반 오든", "반 리벡", "반 로이", "반 스타펜", "베릭", "바론", "바셀레", "바스틱",
                "바테빌", "바즈", "벨린스", "베나르", "벤델린", "베니아드", "베네커", "베어벡", "베르베케",
                "브리스케", "베르가", "베르하베르트", "베르하이겐", "버멀런", "버놀드", "버논", "베시", "베슬리",
                "비치오", "빌라스", "빌젠", "빌레트", "바이올렛", "비퐁", "비비안트", "블라코스", "블록", "보그츠",
                "볼라드", "볼크만", "볼츠", "폰 에팅스하우젠", "폰 사허", "폰 슈뢰더", "보리스", "브란체프", "브롬",
                //W
                "워츠무스", "와커", "와다드", "월버그", "웨거", "왈트하임", "월처", "월링스", "월마", "웨커",
                "웨일", "와셀", "와이스브란츠", "웰러", "웬츠", "위드만", "워런스", "워슨", "울프", "위넨",
                //X
                "크산토스", "샤페리", "시디스", "크하쉬카",
                //Y
                "야넬", "얀코프", "예거", "요르다노프,", "이바르렌", "이베르뉴",
                //Z
                "자발라", "자벨", "잔", "자미스", "자만", "잠벨로", "자넬리", "자란즈", "자바스키", "제브",
                "제든", "제리", "제르만", "저글리", "지프", "조폴리", "조라브코프", "질베르슈타인"
        );

        return names.get(random.nextInt(names.size() -1));
    }

    private static String maleName() {
        List<String> names = Arrays.asList(
                //A
                "알라트", "알로트", "아반테스", "아바로츠", "아벨라르", "애버리", "아브라미우스", "아비도스",
                "아카에우스", "아셀린", "아세테스", "아카드", "아킬라", "아신디누스", "아콧", "아쿤", "아쿠르",
                "아달베로", "아달하르트", "아델라드", "아델롯", "아데노", "아돈", "아드리아", "아드손", "에이가",
                "아겔마이어", "아일드렛", "아엘가르", "이솝", "아가멤논", "에톨로스", "아게시오", "아지드",
                "아타리", "아이아스", "아일마르", "아이메릭", "아이타", "아쿠하타", "알라나", "알레인", "알라드",
                "알베리", "알비누스", "알브릭트", "알키모스", "알딘", "알데문트", "알렉", "엘러롯", "알렉산디르",
                "알렉슨", "앨린", "알폰스", "엘릭", "엘리카", "알케타스", "알크미온", "알란", "알메릭", "알로아",
                "알로츠", "알페오스", "알루어드", "앨리어드", "알바", "아말", "아만드", "아모드", "암베", "아메츠",
                "암펠리우스", "알피온", "에이몬", "아나츠", "안첼로트", "안키에", "안다기스", "안데르", "안도니",
                "안드레아", "앤드루", "안드리스", "아네스", "안케틴", "안셀름", "아스프로이", "안스카르", "안테노르",
                "안티고노스", "앤티클레스", "안티푸스", "앤턴", "아팔", "아펠리콘", "아폴로", "아라투스", "아르카로라스",
                "아르쿨프", "아르도인", "아르기", "아리프론", "아리스턴", "아만드", "아르누트", "아놀드", "아랏츠",
                "아르테미오스", "아르투르", "아스칼로", "아실라", "아시우스", "아스틴", "아타마스", "아타올프", "아델라르",
                "오스틴", "에비넬", "에이버리", "아빌라", "아자리", "아즈벨리",
                //B
                "바킬리드", "바데론", "배리어스", "바이아르트", "발란", "발라디", "볼드윈", "발레딘", "발레시오",
                "발리안", "바딘", "바렛", "바스브룬", "바실리우스", "바차스", "베헤", "베네딕", "베넷", "벵거",
                "베누이트", "베라르트", "베렌드", "베린", "버나드", "베르노", "버트", "베르틴", "베사스", "베르툴프",
                "베본", "비켄디", "비하르", "비글리스", "빌레보트", "비리누스", "비살테스", "블레이즈", "블랭코",
                "밥", "보데놀프", "보에투스", "보르제스", "브란딜라", "브리누스", "브루안트", "브라이언", "버넬",
                //C
                "케인", "칼리마코스", "칸닥", "카나바스", "칼론", "카친", "카시온", "세피우스", "셀레아스", "젝스",
                "차브리아스", "차이로폰", "찰리", "카론", "클로더머", "켈드릭", "크로미스", "크리스토불루스", "크리스",
                "클레어", "클라렌", "클리오니쿠스", "클레어테스", "클로네어", "코본", "코멘타스", "코논", "콘스탄스",
                "코넬", "쿠르투아", "크레핀", "크레상트", "크레톤", "크로커스", "크로노스", "쿠니문트", "사이온",
                "키릴", "키리쿠스",
                //D
                "다비", "다이달로스", "다임베르트", "다일러", "다마노스", "데이먼", "디나우스", "다미아노스", "다노르",
                "다프니스", "데니스", "디니아스", "델리온", "데네스", "데릭", "더클로스", "디콘", "디케", "디터",
                "디마루스", "디오클레스", "더크", "도브", "돌레오", "도미닉", "도리오스", "듀크", "드루엣", "듀란드",
                "디므노스", "다이크", "드로트", "도리안", "디오니소스",
                //E
                "에이드문트", "에알드레드", "이테", "에버울프", "에브리무드", "에버하트", "에클라오스", "에케무스",
                "에키", "에드먼드", "에듀인", "에드워드", "에기노프", "에곤", "에렌", "아에엘트", "아이드하트",
                "에일러트", "아인하르트", "아이오네오스", "알버트", "엘리온", "알렉산더", "엘마르", "알페노르",
                "엠브리코", "에멜리쿠스", "에메논", "에머릭", "에몬드", "엥겔리어", "엔게노우프", "엥거랜드", "이오스",
                "에피스터", "에르캄포트", "에르기누스", "에렘발트", "에르니스", "에릭스", "에토누스", "에델마르",
                "유케노르", "에우노르", "유클레스", "유릭", "에우리필로스", "유스타스", "에브루인", "이브",
                "에브룰", "유스티스", "아일가르",
                //F
                "파비아누스", "파비엔", "파라몬트", "파르만", "포크스", "펠리페", "피에토", "피텔", "플라코",
                "플랑베르트", "플로렌트", "펠리페", "페란트", "페르시오", "페리", "피에토", "폴케", "프랑코",
                "프레이", "프리어트", "프레데릭", "푸아노", "피린",
                //G
                "가비렐", "갓프리드", "가일라드", "갈라페", "게일", "갈레렌", "갈루어", "갈리엔", "갈테리우스",
                "갈리에누스", "갈린두스", "가멜린", "가멜루스", "가넬론", "가렐트", "개럿", "가르체아", "가스콧",
                "게스티즈", "고베르", "가우드", "가우마르다스", "고베인", "가웬", "가즈테아", "제프리", "겔레온",
                "제프리", "제럴드", "게르보도", "게를란드", "제롤트", "게르베스", "길버트", "길렛", "길롯",
                "지라드", "기리아우", "거버스", "지프리드", "글라우코스", "고벨린", "고다스", "갓프리", "고딜라스",
                "골딘", "고메릭", "고르기온", "구베르", "그렉", "그레핀", "그림볼", "게리", "기욤", "길리에름",
                "기오트", "기샤르", "군타르", "구티카스", "기르티아스", "자라스", "갸라드",
                //H
                "하비", "하콘", "하브레함", "하겐", "하이츠", "헤일브란", "헤일로", "할루인", "하멜롯", "하밀락스",
                "햄린", "하몬", "하문트", "행크", "한", "하네스", "하밀카", "한니발", "하노", "하킨", "하랄",
                "하버", "하리발트", "하만", "하르츠", "하베론", "호킨", "헤베르트", "하인츠", "하인리쿠스", "헬레노스",
                "헬리난드", "헤마트", "헨리오트", "헤럴드", "허큘리스", "헤렌슈게", "하베르트", "헤르메아스",
                "헤리", "허비스", "휴", "히케타온", "히에로", "힐더릭", "히파수스", "히케", "홉", "호지킨",
                "호스베르투스", "호스문트", "하워드", "흐루디거", "허드", "휴고", "휴버트", "험프리", "후스타즈",
                "힐루스", "히르티우스",
                //I
                "일메네스", "아이무스", "이오코스", "이반", "이본", "이카루스", "이그나이스", "이멜", "임베르트",
                "임브루스", "인다르", "인겔람", "잉그램", "인코", "이올라오스", "이오비누스", "이파르", "아이라이츠",
                "이스케누스", "이시도르", "이시온", "이틸루스", "아이본", "이바누스",
                //J
                "재클린", "제이크", "자비스", "제프", "젤리히", "지웰", "조앤스", "조셉", "조엘", "존", "졸란",
                "졸라누스", "조던", "조웰", "줄프", "줄리앙", "줄리아누스", "주르단",
                //K
                "카드모스", "카후마누", "칼차스", "칼리아스", "칼리노스", "칼론", "칸나디스", "칼레스", "카르멜",
                "카센", "카롤루스", "카소스", "켈러멘", "케멘", "켄드릭", "케니쿠스", "킵", "케팔론", "케르키온",
                "키토스", "클라우스", "클레오비스", "코논", "크랜토르", "크리톤", "쿠페", "키노스", "키릴로스",
                //L
                "라보타스", "락타니우스", "라펠레", "라고스", "라이오스", "람바드", "라미시오", "램폰", "랜슬롯",
                "란도", "라오다마스", "라파네스", "라랑스", "라타룬", "로도스", "로렌시오스", "랑드로스", "리르트",
                "레페인", "레히오르", "렘누스", "레오", "레오넬", "레타드", "뤼트발트", "뢰비빌드", "리허",
                "리하르트", "리울프", "론", "루이스", "롭", "로렌스", "로타", "러벨", "로베리히", "러버릭",
                "루시엔", "루트비히", "루크", "루페", "리카온", "리엘", "리엔", "리오넬", "리산드로스",
                //M
                "마카르", "메이온", "마간하르트", "마혼드", "메일릿", "마오르가", "말리스", "말프라미스", "마노아",
                "마크", "마르셀", "마르쿠스", "마르네스", "마틴", "마틀렛", "마루투스", "모콜린", "모렌티우스",
                "막시미아누스", "메돈", "메가스", "멜레스", "멤논", "메네스테스", "멘테", "메르카디에", "뮤릭",
                "미다스", "미켈", "마일스", "미노스", "미키엘", "모렐", "모리스", "뮤틴스", "마이클",
                //N
                "나바르", "나르키소스", "나자레스", "닐", "니카노르", "니콜라오", "니헤", "노엘", "노르베르트",
                "노턴", "니겔", "누실라",
                //O
                "오베르트", "오살로스", "오디넬", "오디우스", "오거", "아일리아스", "올리버", "올리비에",
                "올버", "올림푸스", "오메르", "오네타스", "오랭", "오더릭", "올란드", "오르티", "오스카",
                "오세베른", "오스가르", "오스핀", "오스웰", "오티스", "오웨인", "오웬", "오즈웰",
                //P
                "파블로", "파에른", "파이오스", "팔라에몽", "팔라스", "파나에티우스", "팬타레스", "파누엘",
                "파라베츠", "파르메니온", "파르세팔", "파스칼", "파시온", "패터릭", "파트로바스", "파울루",
                "페이넬", "페가수스", "펠라곤", "펠리아스", "퍼시벨", "페르디카스", "페란도", "페이돈", "팬스",
                "펠리페", "필", "필라온", "필로니코스", "피닉스", "포티누스", "피어레스", "파이드", "폴리오",
                "폰테우스", "포즈", "프레시노스", "필레우스", "피타고네스",
                //Q
                "퀀틴", "키토",
                //R
                "라프", "라벨", "라돌프", "레긴퍼트", "라이어", "레이날드", "라날드", "람미우스", "랭킨",
                "라눌프", "라올렛", "라우프", "롤린", "로킨", "레커드", "레치문트", "리볼데", "라인프리드",
                "렘프리", "레몽", "레노데", "르누프", "렉스", "레이먼드", "리발트", "리치", "릭", "리오네",
                "로베르투스", "로데릭", "로제르", "롤랑", "로메인", "로버트", "루노", "리차르드", "러셀",
                //S
                "사바", "새로스", "사라르드", "샌더스", "샌디", "산토", "스캐맨디우스", "스콜라투스", "세버",
                "셀라체", "세렐", "세브린", "시브란트", "실레노스", "시논", "시스베르트", "스키론", "스테이시",
                "스테판", "스트라보", "슈거", "샤그로스", "실로손",
                //T
                "타디카", "타이노", "탈라우스", "탈로스", "테인", "타우린", "테드릭", "텔로", "탈레스", "테라",
                "탄크레드", "테오시스", "테오데릭", "테오필리오스", "테오스", "테라톤", "테살로스", "티에보",
                "시르켈", "토른", "티보우", "티발트", "토마스", "트리스탄", "툴루인", "툴루드", "터스텐", "티볼트",
                "타이온", "티렐", "티다스", "팀", "티모티", "티렐", "토마스", "툰",
                //U
                "우벤", "우엘레르트", "우구르츠", "울페르트", "울루릭", "엄프릭", "우르스", "우루툰",
                //V
                "바아네스", "발라미르", "발리아", "발데브론", "발렌티누스", "베인", "발터", "바사시우스", "베네세",
                "베티아스", "빅터", "빈스", "빈센트", "비탈리아누스", "비투스", "브빌퀸", "빌", "비비안",
                //W
                "왈라", "월슐린", "왈데브", "왈디프", "왈가노스", "월버트", "월리", "와이너", "워먼", "워너러스",
                "와실리", "와트", "웨슬로", "베르너", "위차드", "위도", "윌콕", "빌헬름", "윌코", "월리엄", "위마르크",
                "위스탄", "위비아스", "와이어트", "와이먼", "와이먼드", "욘", "와이스턴",
                //X
                "샤바트", "잘바도르", "크산토스", "제노크레이트", "슈반", "슈르딘",
                //Y
                "이데베르트", "이폴리시", "율리", "이본", "이보누스", "유웨인",
                //Z
                "자발", "제베", "제마르쿠스", "제노", "제피리누스", "제닌", "진델", "졸탄", "조일", "조일러스"
        );

        return names.get(random.nextInt(names.size() -1));
    }

    private static String femaleName() {
        List<String> names = Arrays.asList(
                //A
                "아프테", "알리나", "에이스", "아벨리", "아셀리나", "아델라", "아델리나", "아엘리브", "에텔린다",
                "아글리아", "아그네티스", "아이카테린", "아일레타", "알라이스", "앨비", "아멜리아", "아나벨라",
                "아네스", "아라벨라", "아벨", "아르테아", "아실리아", "아스테라", "앨리스", "에멀린", "아믹",
                "아두나", "에이돈", "아엘리에노르", "아일레스", "알브루가", "알디에타", "알렉산드라", "앨리드",
                //B
                "바벨", "바이블", "바델로타", "바베리", "바실레아", "베아", "베아트리체", "베트리샤", "베케",
                "벨로케", "베나", "베레타", "베르테", "비앙카", "비올라", "브루네", "블랑시아", "비델루에", "베가",
                //C
                "카이사리아", "칼립소", "카산더", "카세", "카텔", "카테리나", "캐서린", "체슬리", "체셀리나",
                "세실리아", "셀레스틴", "클로이", "크리스티나", "크리세", "키실리아", "클라라", "클레멘시아",
                "클리오", "콘스탄티나", "크리스티네", "사이벨레", "키렌",
                //D
                "델리아스", "데오니시아", "다이애나", "디나에", "디오니스", "도미니카", "도리스", "도리치예",
                "디아나", "다이오니시아", "디오타", "디오네", "디엔", "다이애나",
                //E
                "이드", "에버리트", "에델린", "에델리나", "에델롯", "에디아", "에다르트제타", "에디즈", "에드니",
                "에겔리나", "에겔힐트", "일라리아", "일레인", "엘린", "엘레나", "엘리노라", "엘리자베스", "엘라",
                "엘리네", "에멜린", "엠마", "에밀리나", "에네카", "엥겔가르드", "엔나", "에밤", "이오스", "에르디",
                "에리카", "에를레아", "에르미나", "에스델린", "에델", "에델렌다", "에델가르드", "유델린", "에우도키아",
                "유리아", "유로파", "에우세비아", "에벨리나", "에버릴",
                //F
                "파비아", "파비아나", "바라힐다", "펠리시아", "펠리스", "피케", "필리스", "피나", "플로렌스", "플로라",
                "폴클린다", "포르투나타", "프레데가르드", "프루인", "프란체스카",
                //G
                "가보네", "가일란", "갈라아네", "가비", "가로아", "게티", "게일라", "제네바", "겔렌", "조지아",
                "제럴렌트", "제로아", "게르트", "제아", "지젤라", "고델린다", "그레이스", "그리젤", "군드라다",
                "구넬", "군닐드", "기젤", "고디프", "고두아",
                //H
                "핼리", "하이스", "하르케", "해리엇", "하비사", "헤겔리나", "헬첸", "힐", "헬레나", "헬린",
                "힐리센트", "헤마", "헤렌프리다", "헤르미온느", "헤르미네", "헥테", "히아트", "힐데", "힐델라나",
                "힐다", "히폴리타", "허셀",
                //I
                "아이오네", "아이본", "이다", "이데슬레브", "이도니아", "일라리아", "이마니에", "이멜다", "인페",
                "잉겔라", "이오라르", "이노", "이올란테", "아이라리아", "이란츠", "이르멜레", "이자드", "이소타",
                "이베타", "이자로", "아자스쿤",
                //J
                "자이오네", "젤리안", "제네퍼", "지스몬드", "조시", "줄리아", "쥬에테", "줄리안", "줄리타",
                "쥬엘리나", "저스티나",
                //K
                "칼라레", "칼릭세이나", "카산드라", "케틀린", "캐서린", "카트리나", "카탈린", "켐마", "클로로리스",
                "킴베리", "킨부르가", "클라이오", "클레오파트라", "클라이메네", "크림힐드", "크라벨린", "키네부르크",
                "키프리스",
                //L
                "라디나", "라비니아", "란드가르다", "란투아라", "라레이츠", "라자르트", "로라", "로렐라", "라베나",
                "로레타", "레센타", "레플레드", "레프켄", "레가르다", "레전디카", "레오니나", "레타스", "레우로나",
                "레자나", "리아", "리에프테", "리지", "리넷", "리오드가르드", "뤼트가르드", "로베룬", "루비아스",
                "루크", "리라", "루시",
                //M
                "마리에타", "마벨", "마빌리아", "마델가르드", "마이케", "말렌", "마거릿", "마르게에", "마리아카",
                "마제리아", "마르실리아", "매뉴", "마틸라", "매티", "메아카", "메겐베르타", "메이프테", "멜라니",
                "메리엘", "메르웨나", "미카엘라", "밀센티아", "밀라", "미노타", "미케", "미렌츠", "몽테뉴",
                "뮤리엘", "미칼레", "모스키아",
                //N
                "나파로아", "나우시카", "나즈발", "넬", "네펠레", "니콜라", "노라",
                //O
                "오델라", "오딘", "오디에나", "오이티아", "올라비아", "올리브", "오르바이즈", "오리홀트", "오스가르드",
                "오시스", "오틸리아", "우르세",
                //P
                "팰리스", "팔라티나", "파노페", "파리에테", "파라아티스", "파테리아", "페첼", "페넬리", "페르시스",
                "페트로나", "파에드라", "프레미", "피아", "플레산시아", "폴리세나", "프로비나", "프로세리아", "푸르넬",
                "피라",
                //Q
                "퀴누아",
                //R
                "라", "라데켄", "레닐다", "라모나", "라타", "레이네라인", "리젠부루가", "레이메리히", "렐린디스",
                "레아", "레이네", "랑", "리체사", "리케", "리넬트", "린넷", "로델린다", "로이스", "로슬리", "로이시아",
                "로사문트", "로틀렌다", "로이스", "라이칠드",
                //S
                "세트리스", "생디슈", "세인츠", "실루아", "실비아넬라", "스콜라스", "스콜라", "세딜", "세헤베", "셀라",
                "시벨라", "시실리아", "시베르테", "실리나", "시밀체", "소피", "스피오", "스타뉴", "스티나", "스트라토니스",
                "수잔나", "시아그리아", "샤르디스", "세를", "시슬리",
                //T
                "테이시", "탈케", "테아", "테레사", "테트라디아", "테베", "테오도라", "테살라", "티아", "티에체",
                "틸다", "툴루", "트릭시", "티셀린", "티로",
                //U
                "우델린", "우델리나", "울프힐드", "울베바", "우레아", "우소아",
                //V
                "베레나", "비올란테", "바이올렛", "비비안", "비질티아", "비알데베르타",
                //W
                "와크릴", "발드라다", "랑델리엔", "와트셀리나", "발트부르크", "베네프레다", "베르부르크", "울페우아",
                "울벨라", "와이버그", "위비르",
                //X
                "사바딘", "크산티페", "세네", "시실리",
                //Y
                "야요네", "이데네예", "일라이어", "이메니아", "유우타", "요르다나", "이스메이", "유소파", "요르시아",
                "이세벨",
                //Z
                "자발", "자발레타", "잘로아", "제란", "주베로아", "주비아", "주하이츠", "주리아"
        );

        return names.get(random.nextInt(names.size() -1));
    }
}